###################################################################

# Created by write_sdc on Thu Jan  2 23:29:47 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_operating_conditions -max ss0p6vm40c -max_library saed14slvt_ss0p6vm40c\
                         -min ff0p88v125c -min_library saed14slvt_ff0p88v125c
set_ideal_network [get_ports clk]
set_ideal_network [get_ports rst]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_clock_uncertainty 0.01  [get_clocks clk]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[31]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[30]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[29]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[28]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[27]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[26]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[25]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[24]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[23]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[22]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[21]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[20]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[19]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[18]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[17]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[16]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[15]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[14]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[13]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[12]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[11]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[10]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[9]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[8]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {im_read_data[0]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[31]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[30]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[29]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[28]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[27]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[26]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[25]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[24]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[23]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[22]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[21]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[20]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[19]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[18]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[17]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[16]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[15]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[14]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[13]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[12]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[11]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[10]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[9]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[8]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[7]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[6]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[5]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[4]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[3]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[2]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[1]}]
set_input_delay -clock clk  -max 0.6  [get_ports {dm_read_data[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[15]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[14]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[13]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[12]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {im_address[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_w_en[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_w_en[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_w_en[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_w_en[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[15]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[14]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[13]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[12]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_address[0]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[31]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[30]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[29]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[28]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[27]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[26]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[25]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[24]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[23]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[22]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[21]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[20]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[19]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[18]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[17]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[16]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[15]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[14]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[13]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[12]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[11]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[10]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[9]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[8]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[7]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[6]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[5]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[4]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[3]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[2]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[1]}]
set_output_delay -clock clk  -max 0.6  [get_ports {dm_write_data[0]}]
